Revit 2026 API

# TriangleInShellComponent Class

---

This class represents a triangle in a TriangulatedShellComponent object. The triangle is defined by its vertices, which are specified by their indices in the TriangulatedShellComponent's array of vertices.

SystemObject Autodesk.Revit.DBTriangleInShellComponent

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TriangleInShellComponent : IDisposable
```
```vb
Public Class TriangleInShellComponent
	Implements IDisposable
```
```cpp
public ref class TriangleInShellComponent : IDisposable
```
```fsharp
type TriangleInShellComponent =
    class
        interface IDisposable
    end
```

The TriangleInShellComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TriangleInShellComponent | Creates a copy of the given TriangleInShellComponent |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | VertexIndex0 | Index of the triangle's first vertex in the TriangulatedShellComponent's array of vertices. |
|  | VertexIndex1 | Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices. |
|  | VertexIndex2 | Index of the triangle's third vertex in the TriangulatedShellComponent's array of vertices. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TriangleInShellComponent |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A TriangulatedShellComponent stores an array of TriangleInShellComponent objects representing the triangles of the triangulation. An external class is used because the API does not allow the use of a triple of integers. Note that a TriangleInShellComponent must only be used in the context of a single, fixed TriangulatedShellComponent.

#### Reference

Autodesk.Revit.DB Namespace